# RatioTo12 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..RatioTo12 Property
UnitTypeId Class See Also
---
Ratio : 12.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId RatioTo12 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RatioTo12 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RatioTo12 {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace